tangyangguang/Esp32Base/test/test_native_record_store_harness/test_main.cpp
#include <unity.h>

#include <algorithm>
#include <map>
#include <set>
#include <string>
#include <vector>

#include "runtime/Esp32BaseFs.h"
#include "runtime/Esp32BaseAppEvents.h"
#include "runtime/Esp32BaseRecordStore.h"
#include "runtime/Esp32BaseTime.h"
#include "runtime/internal/Esp32BaseFsInternal.h"

namespace {

std::map<std::string, std::vector<uint8_t>> g_files;
std::set<std::string> g_directories;
size_t g_totalBytes = 1024 * 1024;
Esp32BaseTime::Snapshot g_time = {false, Esp32BaseTime::SOURCE_UPTIME, 0, 10, 1, 0};
uint32_t g_fixedSlotVisitCalls = 0;

void resetHarness() {
    g_files.clear();
    g_directories.clear();
    g_directories.insert("/");
    g_totalBytes = 1024 * 1024;
    g_time = {false, Esp32BaseTime::SOURCE_UPTIME, 0, 10, 1, 0};
    g_fixedSlotVisitCalls = 0;
}

Esp32BaseRecordStore::StoreDefinition definition(const char* name = "watering",
                                                  uint16_t version = 1,
                                                  uint32_t maximumBytes = 224,
                                                  uint32_t minimumFreeBytes = 0) {
    Esp32BaseRecordStore::StoreDefinition value;
    value.recordTypeName = name;
    value.storeVersion = version;
    value.payloadSizeBytes = 8;
    value.maximumFileBytes = maximumBytes;
    value.minimumFileSystemFreeBytes = minimumFreeBytes;
    return value;
}

void payload(uint8_t* out, uint32_t value) {
    for (size_t i = 0; i < 8; ++i) out[i] = static_cast<uint8_t>(value + i);
}

struct IdCollector {
    std::vector<uint32_t> ids;
};

void collectId(const Esp32BaseRecordStore::RecordView& record, void* user) {
    static_cast<IdCollector*>(user)->ids.push_back(record.recordId);
}

} // namespace

bool Esp32BaseFs::begin() { return true; }
bool Esp32BaseFs::isReady() { return true; }
bool Esp32BaseFs::format() { g_files.clear(); return true; }
bool Esp32BaseFs::createFixedFile(const char* path, uint32_t size, uint8_t fillByte) {
    g_files[path] = std::vector<uint8_t>(size, fillByte);
    return true;
}
bool Esp32BaseFs::readBytesAt(const char* path, uint32_t offset, uint8_t* out, size_t maximum, size_t* readLength) {
    if (readLength) *readLength = 0;
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || !out || offset > found->second.size()) return false;
    const size_t length = std::min(maximum, found->second.size() - offset);
    std::copy(found->second.begin() + offset, found->second.begin() + offset + length, out);
    if (readLength) *readLength = length;
    return true;
}
bool Esp32BaseFs::writeBytesAt(const char* path, uint32_t offset, const uint8_t* data, size_t length) {
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || (!data && length > 0) || offset > found->second.size() || length > found->second.size() - offset) return false;
    std::copy(data, data + length, found->second.begin() + offset);
    return true;
}
Esp32BaseFs::RemoveFileResult Esp32BaseFs::removeFileWithRecovery(const char* path) {
    return g_files.erase(path ? path : "") ? REMOVE_FILE_DELETED : REMOVE_FILE_FAILED;
}
bool Esp32BaseFs::removeFile(const char* path) { return g_files.erase(path ? path : "") != 0; }
bool Esp32BaseFs::rename(const char* from, const char* to) {
    auto found = g_files.find(from ? from : "");
    if (found == g_files.end() || g_files.count(to ? to : "")) return false;
    g_files[to] = found->second;
    g_files.erase(found);
    return true;
}
bool Esp32BaseFs::exists(const char* path) {
    const std::string value = path ? path : "";
    return g_files.count(value) || g_directories.count(value);
}
int64_t Esp32BaseFs::fileSize(const char* path) {
    auto found = g_files.find(path ? path : "");
    return found == g_files.end() ? -1 : static_cast<int64_t>(found->second.size());
}
bool Esp32BaseFs::mkdir(const char* path) { g_directories.insert(path ? path : ""); return true; }
size_t Esp32BaseFs::totalBytes() { return g_totalBytes; }
size_t Esp32BaseFs::usedBytes() {
    size_t used = 0;
    for (const auto& entry : g_files) used += entry.second.size();
    return used;
}
size_t Esp32BaseFs::freeBytes() { return usedBytes() < g_totalBytes ? g_totalBytes - usedBytes() : 0; }
bool Esp32BaseFs::storageInfo(size_t& total, size_t& used) { total = totalBytes(); used = usedBytes(); return true; }

bool esp32base_internal::fsWriteSegmentsAt(const char* path,
                                           uint32_t offset,
                                           const FsWriteSegment* segments,
                                           size_t segmentCount) {
    for (size_t i = 0; i < segmentCount; ++i) {
        if (!Esp32BaseFs::writeBytesAt(path, offset, segments[i].data, segments[i].length)) return false;
        offset += static_cast<uint32_t>(segments[i].length);
    }
    return true;
}

bool esp32base_internal::fsVisitBytesAt(const char* path,
                                        uint32_t offset,
                                        uint32_t length,
                                        FsReadVisitor visitor,
                                        void* user) {
    std::vector<uint8_t> buffer(length);
    size_t readLength = 0;
    return Esp32BaseFs::readBytesAt(path, offset, buffer.data(), buffer.size(), &readLength) &&
           readLength == length && visitor(buffer.data(), buffer.size(), user);
}

bool esp32base_internal::fsVisitFixedSlots(const char* path,
                                           uint32_t dataOffset,
                                           uint32_t slotSize,
                                           uint32_t capacity,
                                           uint32_t firstSlot,
                                           uint32_t slotCount,
                                           bool descending,
                                           FsFixedSlotVisitor visitor,
                                           void* user) {
    ++g_fixedSlotVisitCalls;
    auto found = g_files.find(path ? path : "");
    if (found == g_files.end() || slotSize == 0 || capacity == 0 || firstSlot >= capacity ||
        slotCount > capacity || !visitor ||
        static_cast<uint64_t>(dataOffset) + static_cast<uint64_t>(slotSize) * capacity > found->second.size()) {
        return false;
    }
    uint32_t slot = firstSlot;
    for (uint32_t visited = 0; visited < slotCount; ++visited) {
        const uint32_t offset = dataOffset + slot * slotSize;
        if (!visitor(slot, 0, found->second.data() + offset, slotSize, user)) return false;
        if (descending) slot = slot == 0 ? capacity - 1U : slot - 1U;
        else slot = slot + 1U == capacity ? 0 : slot + 1U;
    }
    return true;
}

Esp32BaseTime::Snapshot Esp32BaseTime::snapshot() { return g_time; }
bool Esp32BaseTime::resolveCurrentBootEvent(uint32_t bootId, uint32_t uptimeSec, uint32_t* epochSec) {
    if (!epochSec || !g_time.synced || bootId != g_time.bootId || g_time.bootStartEpochSec == 0) return false;
    *epochSec = g_time.bootStartEpochSec + uptimeSec;
    return true;
}

#include "runtime/Esp32BaseRecordStore.inc"
#include "runtime/Esp32BaseAppEvents.inc"

void setUp() { resetHarness(); }
void tearDown() {}

void test_create_calculates_capacity_and_file_size() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    Esp32BaseRecordStore::StoreStatus status;
    TEST_ASSERT_TRUE(store.readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(3, status.capacity);
    TEST_ASSERT_EQUAL_UINT32(32, status.slotSizeBytes);
    TEST_ASSERT_EQUAL_UINT32(224, status.actualFileBytes);
    TEST_ASSERT_EQUAL_STRING("/esp32base/records/watering.v1.bin", status.path);
    TEST_ASSERT_EQUAL_UINT32(2, g_fixedSlotVisitCalls);
}

void test_append_rotates_and_reads_latest_first() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8];
    for (uint32_t i = 1; i <= 5; ++i) {
        payload(bytes, i);
        ++g_time.uptimeSec;
        TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    }
    IdCollector collected;
    uint8_t scratch[8];
    TEST_ASSERT_TRUE(store.readLatest(0, 10, scratch, sizeof(scratch), collectId, &collected));
    TEST_ASSERT_EQUAL_UINT32(3, collected.ids.size());
    TEST_ASSERT_EQUAL_UINT32(5, collected.ids[0]);
    TEST_ASSERT_EQUAL_UINT32(4, collected.ids[1]);
    TEST_ASSERT_EQUAL_UINT32(3, collected.ids[2]);
    TEST_ASSERT_EQUAL_UINT32(3, g_fixedSlotVisitCalls);
}

void test_completed_record_uses_duration_and_resolves_time() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    Esp32BaseRecordStore::RecordStartTime start;
    TEST_ASSERT_TRUE(store.captureStartTime(start));
    g_time.uptimeSec = 40;
    g_time.synced = true;
    g_time.epochSec = 1700000040UL;
    g_time.bootStartEpochSec = 1700000000UL;
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendCompleted(start, bytes, sizeof(bytes)));
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found, store.readById(1, output, sizeof(output), record));
    TEST_ASSERT_EQUAL_UINT32(30, record.timing.durationSec);
    uint32_t epoch = 0;
    TEST_ASSERT_TRUE(Esp32BaseRecordStore::resolveStartedEpoch(record.timing, epoch));
    TEST_ASSERT_EQUAL_UINT32(1700000010UL, epoch);
}

void test_corrupt_record_is_skipped_and_reported() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    g_files[store.path()][128 + 20] ^= 0x55;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    store.readStatus(status);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    TEST_ASSERT_EQUAL_UINT32(0, status.recordCount);
}

void test_corrupt_record_id_is_reported_and_read_as_corrupt() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    g_files[store.path()][128] ^= 0x55;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::StoreStatus status;
    store.readStatus(status);
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::Degraded, status.state);
    TEST_ASSERT_EQUAL_UINT32(1, status.damagedRecordCount);
    TEST_ASSERT_EQUAL_UINT32(1, status.recordCount);
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Corrupt,
                      store.readById(1, output, sizeof(output), record));
}

void test_clear_hides_records_and_continues_ids() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.clear());
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::NotFound, store.readById(2, output, sizeof(output), record));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found, store.readById(3, output, sizeof(output), record));
}

void test_different_versions_use_different_files() {
    Esp32BaseRecordStore first;
    Esp32BaseRecordStore second;
    TEST_ASSERT_TRUE(first.begin(definition("feeding", 1)));
    TEST_ASSERT_TRUE(second.begin(definition("feeding", 2)));
    TEST_ASSERT_NOT_EQUAL(0, std::strcmp(first.path(), second.path()));
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(first.path()));
    TEST_ASSERT_TRUE(Esp32BaseFs::exists(second.path()));
}

void test_existing_wrong_size_is_not_rewritten() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    g_files[store.path()].resize(200);
    TEST_ASSERT_FALSE(store.reload());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreState::StructuralFault, store.state());
    TEST_ASSERT_EQUAL_UINT32(200, g_files[store.path()].size());
}

void test_existing_definition_mismatch_is_not_rewritten() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    std::vector<uint8_t>& file = g_files[store.path()];
    for (uint32_t copy = 0; copy < 2; ++copy) {
        uint8_t* header = file.data() + copy * 64U;
        recordStoreWriteU16(header + 8, 2);
        recordStoreWriteU32(header + 36, 0);
        recordStoreWriteU32(header + 36, recordStoreCrc(header, 64));
    }
    const std::vector<uint8_t> beforeReload = file;
    TEST_ASSERT_FALSE(store.reload());
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::DefinitionMismatch, store.lastError());
    TEST_ASSERT_EQUAL_UINT32(beforeReload.size(), g_files[store.path()].size());
    TEST_ASSERT_EQUAL_UINT8_ARRAY(beforeReload.data(), g_files[store.path()].data(), beforeReload.size());
}

void test_minimum_free_space_blocks_business_store_creation() {
    g_totalBytes = 300;
    Esp32BaseRecordStore store;
    TEST_ASSERT_FALSE(store.begin(definition("door-opening", 1, 224, 100)));
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::StoreError::InsufficientFreeSpace, store.lastError());
    TEST_ASSERT_FALSE(Esp32BaseFs::exists("/esp32base/records/door-opening.v1.bin"));
}

void test_partial_slot_writes_never_return_incomplete_new_record() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition("feeding", 1, 160)));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    const std::string path = store.path();
    const std::vector<uint8_t> oldSlot(g_files[path].begin() + 128, g_files[path].begin() + 160);

    payload(bytes, 2);
    ++g_time.uptimeSec;
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    const std::vector<uint8_t> newSlot(g_files[path].begin() + 128, g_files[path].begin() + 160);

    for (size_t written = 1; written < newSlot.size(); ++written) {
        std::copy(oldSlot.begin(), oldSlot.end(), g_files[path].begin() + 128);
        std::copy(newSlot.begin(), newSlot.begin() + written, g_files[path].begin() + 128);
        TEST_ASSERT_TRUE(store.reload());
        Esp32BaseRecordStore::StoreStatus status;
        TEST_ASSERT_TRUE(store.readStatus(status));
        TEST_ASSERT_EQUAL_UINT32(3, status.nextRecordId);
        Esp32BaseRecordStore::RecordMetadata record;
        uint8_t output[8];
        TEST_ASSERT_NOT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                              store.readById(2, output, sizeof(output), record));
    }
}

void test_torn_clear_header_falls_back_to_pre_clear_state() {
    Esp32BaseRecordStore store;
    TEST_ASSERT_TRUE(store.begin(definition()));
    uint8_t bytes[8]; payload(bytes, 1);
    TEST_ASSERT_TRUE(store.appendInstant(bytes, sizeof(bytes)));
    TEST_ASSERT_TRUE(store.clear());
    g_files[store.path()][64] ^= 0x5A;
    TEST_ASSERT_TRUE(store.reload());
    Esp32BaseRecordStore::RecordMetadata record;
    uint8_t output[8];
    TEST_ASSERT_EQUAL(Esp32BaseRecordStore::RecordReadResult::Found,
                      store.readById(1, output, sizeof(output), record));
}

struct EventCollector {
    std::vector<Esp32BaseAppEvents::EventRecord> events;
};

void collectEvent(const Esp32BaseAppEvents::EventRecord& event, void* user) {
    static_cast<EventCollector*>(user)->events.push_back(event);
}

void test_app_events_uses_compact_payload_and_default_budget() {
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::begin());
    TEST_ASSERT_EQUAL_UINT32(2130, Esp32BaseAppEvents::capacity());
    TEST_ASSERT_EQUAL_STRING("/esp32base/records/app-events.v1.bin", Esp32BaseAppEvents::path());
    EventCollector empty;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(0, 10, collectEvent, &empty));
    TEST_ASSERT_EQUAL_UINT32(0, empty.events.size());

    Esp32BaseAppEvents::EventInput input;
    input.eventCode = 1002;
    input.reasonCode = 2101;
    input.objectId = 1;
    input.value1 = 1450;
    input.value2 = 2;
    input.flags = 0x0001;
    input.level = Esp32BaseAppEvents::Level::Warning;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::append(input));

    EventCollector collected;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(0, 10, collectEvent, &collected));
    TEST_ASSERT_EQUAL_UINT32(1, collected.events.size());
    TEST_ASSERT_EQUAL_UINT32(1, collected.events[0].recordId);
    TEST_ASSERT_EQUAL_UINT32(1002, collected.events[0].eventCode);
    TEST_ASSERT_EQUAL_UINT32(2101, collected.events[0].reasonCode);
    TEST_ASSERT_EQUAL_INT32(1450, collected.events[0].value1);
    TEST_ASSERT_EQUAL_UINT16(0x0001, collected.events[0].flags);
    Esp32BaseAppEvents::EventStoreStatus status;
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readStatus(status));
    TEST_ASSERT_EQUAL_UINT32(48, status.storage.slotSizeBytes);
    TEST_ASSERT_EQUAL_UINT32(102368, status.storage.actualFileBytes);
}

int main(int argc, char** argv) {
    UNITY_BEGIN();
    RUN_TEST(test_create_calculates_capacity_and_file_size);
    RUN_TEST(test_append_rotates_and_reads_latest_first);
    RUN_TEST(test_completed_record_uses_duration_and_resolves_time);
    RUN_TEST(test_corrupt_record_is_skipped_and_reported);
    RUN_TEST(test_corrupt_record_id_is_reported_and_read_as_corrupt);
    RUN_TEST(test_clear_hides_records_and_continues_ids);
    RUN_TEST(test_different_versions_use_different_files);
    RUN_TEST(test_existing_wrong_size_is_not_rewritten);
    RUN_TEST(test_existing_definition_mismatch_is_not_rewritten);
    RUN_TEST(test_minimum_free_space_blocks_business_store_creation);
    RUN_TEST(test_partial_slot_writes_never_return_incomplete_new_record);
    RUN_TEST(test_torn_clear_header_falls_back_to_pre_clear_state);
    RUN_TEST(test_app_events_uses_compact_payload_and_default_budget);
    return UNITY_END();
}
